package data

// 这里是数组，不安全。但是为了性能，牺牲了数据安全性

var Autonos3 = [...]string{"内蒙古"}

var Autonos2 = [...]string{"宁夏", "广西", "新疆", "西藏"}

var Provinces3 = [...]string{"黑龙江"}
var Provinces2 = [...]string{"云南", "台湾", "吉林", "四川", "安徽", "山东", "山西", "广东", "江苏", "江西", "河北", "河南", "浙江", "海南", "湖北", "湖南", "甘肃", "福建", "贵州", "辽宁", "陕西", "青海"}

func Provinces23() []string { return append(Provinces3[:], Provinces2[:]...) }

var Municities2 = [...]string{"上海", "北京", "天津", "重庆"}
var SpecialRegions2 = [...]string{"香港", "澳门"}

// 州/盟：地级市级；
var Leagues4 = [...]string{"锡林郭勒"}
var Leagues3 = [...]string{"阿拉善"}
var Leagues2 = [...]string{"兴安"}

// 州：地级自治市
var Prefecture8 = [...]string{"克孜勒苏柯尔克孜"}
var Prefecture4 = [...]string{"巴音郭楞", "博尔塔拉", "克孜勒苏", "西双版纳"}
var Prefecture3 = [...]string{"黔东南", "黔西南"}
var Prefecture2 = [...]string{"延边", "恩施", "湘西", "阿坝", "甘孜", "凉山", "黔南", "楚雄", "红河", "文山", "大理", "德宏", "怒江", "迪庆", "临夏", "甘南", "海南", "海北", "黄南", "果洛", "玉树", "伊犁", "昌吉"}

var Cities4 = [...]string{"齐齐哈尔", "五大连池", "香格里拉", "呼和浩特", "呼伦贝尔", "乌兰察布", "鄂尔多斯", "巴彦淖尔", "额尔古纳", "乌兰浩特", "霍林郭勒", "锡林浩特", "二连浩特", "乌鲁木齐", "克拉玛依", "可克达拉", "图木舒克", "阿拉山口", "霍尔果斯"}
var Cities3 = [...]string{"马鞍山", "武夷山", "嘉峪关", "六盘水", "石家庄", "秦皇岛", "张家口", "高碑店", "丹江口", "老河口", "张家界", "冷水江", "公主岭", "梅河口", "景德镇", "井冈山", "共青城", "连云港", "张家港", "葫芦岛", "瓦房店", "普兰店", "调兵山", "大石桥", "哈尔滨", "牡丹江", "佳木斯", "七台河", "双鸭山", "绥芬河", "平顶山", "三门峡", "驻马店", "攀枝花", "都江堰", "峨眉山", "格尔木", "德令哈", "五指山", "防城港", "满洲里", "扎兰屯", "阿尔山", "牙克石", "石嘴山", "青铜峡", "日喀则", "吐鲁番", "石河子", "五家渠", "阿拉尔", "铁门关", "阿克苏", "阿图什", "库尔勒", "阿勒泰"}

// 自治旗：县级；共3个自治旗
var AutonoBanners4 = [...]string{"莫力达瓦"}
var AutonoBanners3 = [...]string{"鄂温克", "鄂伦春"}

// 旗：县级；
var Banners8 = [...]string{"达尔罕茂明安联合"}
var Banners6 = [...]string{"科尔沁左翼中", "科尔沁左翼后", "察哈尔右翼中", "察哈尔右翼前", "察哈尔右翼后", "科尔沁右翼前", "科尔沁右翼中"}
var Banners5 = [...]string{"阿鲁科尔沁", "新巴尔虎左", "新巴尔虎右", "西乌珠穆沁", "东乌珠穆沁"}
var Banners4 = [...]string{
	"土默特左", "土默特右", "克什克腾", "鄂托克前", "伊金霍洛", "陈巴尔虎", "乌拉特中", "乌拉特前", "乌拉特后", "苏尼特左", "苏尼特右", "阿拉善左", "阿拉善右",
}
var Banners3 = [...]string{
	"巴林左", "巴林右", "喀喇沁", "翁牛特", "达尔罕", "扎鲁特", "额济纳", "准格尔", "太仆寺", "四子王", "扎鲁特",
	"准格尔", "达拉特", "鄂托克", "杭锦后", "正镶白", "太仆寺", "阿巴嘎", "扎赉特", "额济纳",
	"科右中", "科右前", "科左中", "科左后",
}
var Banners2 = [...]string{"敖汉", "库伦", "奈曼", "乌审", "杭锦", "阿荣", "正蓝", "镶黄"}

var AutonoCounties5 = [...]string{"和布克赛尔", "塔什库尔干", "喀喇沁左翼"}
var AutonoCounties4 = [...]string{"察布查尔", "杜尔伯特"}
var AutonoCounties3 = [...]string{"张家川", "阿克塞", "积石山", "巴里坤"}
var AutonoCounties2 = [...]string{"青龙", "大厂", "孟村", "宽城", "丰宁", "围场", "本溪", "桓仁", "清原", "新宾", "岫岩", "宽甸", "阜新", "前郭", "长白", "伊通", "景宁", "长阳", "五峰", "靖州", "新晃", "芷江", "通道", "麻阳", "城步", "江华", "连山", "连南", "乳源", "环江", "罗城", "巴马", "都安", "大化", "融水", "三江", "恭城", "龙胜", "隆林", "富川", "金秀", "昌江", "白沙", "乐东", "陵水", "保亭", "琼中", "石柱", "彭水", "酉阳", "秀山", "马边", "峨边", "北川", "木里", "威宁", "道真", "务川", "关岭", "镇宁", "紫云", "印江", "沿河", "松桃", "玉屏", "三都", "宁蒗", "玉龙", "石林", "禄劝", "寻甸", "峨山", "新平", "元江", "沧源", "耿马", "双江", "景东", "西盟", "澜沧", "墨江", "景谷", "江城", "宁洱", "孟连", "镇沅", "维西", "兰坪", "贡山", "漾濞", "巍山", "河口", "屏边", "金平", "肃南", "天祝", "肃北", "大通", "民和", "循化", "互助", "化隆", "门源", "河南", "木垒", "焉耆"}
var Counties4 = [...]string{
	"和林格尔", "墨竹工卡", "工布江达", "乌鲁木齐", "吉木萨尔",
}
var Counties3 = [...]string{"托克托", "清水河", "大箐山", "九寨沟", "若尔盖", "麻栗坡", "类乌齐", "南木林", "谢通门", "聂拉木", "浪卡子", "曲麻莱", "托克逊", "尼勒克", "特克斯", "布尔津", "哈巴河", "吉木乃", "呼图壁", "玛纳斯", "阿瓦提", "阿克陶", "阿合奇", "英吉沙", "麦盖提", "岳普湖"}

// 单字县（包括曾用名）
const Counties1 = "赵磁邱魏涉威雄易唐蠡蔚沧青献景盂沁应祁夏绛代古蒲吉隰岚兴临义沛沙莒冠莘费曹单杞嵩叶郏滑浚淇温范睢新息房随攸澧南道横藤容忠荣泸高珙渠理茂寿和歙黟萧泗泾云朗索凤陇眉乾富洋勉佳漳岷成礼康文徽宁环"

var Districts5 = [...]string{"圣安多尼堂", "白云鄂博矿", "鹰手营子矿", "圣方济各堂"}
var Districts4 = [...]string{"加格达奇", "扎赉诺尔", "堆龙德庆", "沙依巴克", "富拉尔基", "克拉玛依", "路氹填海", "花地玛堂", "管城回族", "瀍河回族", "顺河回族区"}
var Districts3 = [...]string{"门头沟", "石景山", "滨海新", "井陉矿", "曹妃甸", "下花园", "峰峰矿", "山海关", "北戴河", "杏花岭", "尖草坪", "万柏林", "昆都仑", "海勃湾", "元宝山", "海拉尔", "康巴什", "科尔沁", "苏家屯", "沈北新", "沙河口", "甘井子", "旅顺口", "普兰店", "太子河", "弓长岭", "清河门", "鲅鱼圈", "双台子", "兴隆台", "二道江", "昂昂溪", "碾子山", "梅里斯达斡尔族", "城子河", "萨尔图", "让胡路", "四方台", "茄子河", "浦东新", "雨花台", "清江浦", "田家庵", "谢家集", "八公山", "龙子湖", "青云谱", "红谷滩", "青山湖", "台儿庄", "东昌府", "禹王台", "东西湖", "伍家岗", "西塞山", "黄石港", "梁子湖", "岳阳楼", "冷水滩", "武陵源", "西乡塘", "铁山港", "金城江", "沙坪坝", "大渡口", "九龙坡", "龙泉驿", "青白江", "金口河", "五通桥", "自流井", "龙马潭", "观山湖", "红花岗", "七星关", "桑珠孜", "七里河", "红寺堡", "大武口", "沙坡头", "水磨沟", "头屯河", "达坂城", "独山子", "白碱滩", "乌尔禾", "油尖旺", "深水埗", "九龙城", "黄大仙", "望德堂", "风顺堂", "嘉模堂", "那玛夏"}
